########################################################################
##
##  "macdev" Brewfile - for mac developers
##
########################################################################
#
# Path for Cask Application aliases
cask_args appdir: "/Applications"
#
#-----------------------------------------------------------------------
# TAPS
#-----------------------------------------------------------------------
#
tap "homebrew/bundle"
# CASKROOM
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
#
#-----------------------------------------------------------------------
# SYSTEM
#-----------------------------------------------------------------------
#
# CORE BINARIES
#
brew "ack"
brew "bash"
brew "bash-completion2"
brew "bzip2"
brew "coreutils"
brew "findutils"
brew "gcc"
brew "git"
brew "git-lfs"
brew "gnu-sed", args: ["with-default-names"]
brew "grc"
brew "grep"
brew "libgit2"
brew "libzip"
brew "moreutils"
brew "openssh"
brew "openssl"
# brew "vim", args: ["override-system-vi"]
brew "wget", args: ["with-iri"]
brew "zlib"
brew "zsh", args: ["without-etcdir"]
brew "zsh-completions"
#
# POPULAR BINARIES
#
brew "imagemagick"
brew "pass"
brew "pv"
brew "rename"
brew "screen"
brew "spark"
brew "ssh-copy-id"
brew "tree"
#
# ADDITIONAL BINARIES
#
# brew "dnsmasq"
# brew "exiv2"
# brew "jp2a"
# brew "libcaca", args: ["with-imlib2"]
# brew "lua"
# brew "lynx"
brew "p7zip"
# brew "pigz"
brew "readline"
# brew "rhino"
# brew "roundup"
# brew "spaceman-diff"
# brew "speedtest_cli"
# brew "webkit2png"
brew "wine"
brew "wine-tricks"
# brew "youtube-dl"
# brew "zopfli"
#
# DEV TOOLS
#
brew "awscli"
brew "elixir"
brew "erlang"
brew "galen"
brew "gradle"
brew "helm"
brew "heroku"
brew "kubectl"
brew "maven"
# brew "mcrypt"
# brew "memcached"
brew "minikube"
# brew "mongodb"
# brew "mysql"
brew "node"
brew "p11-kit"
brew "packer"
# brew "php"
brew "php-code-sniffer"
brew "phpunit"
# brew "postgresql"
brew "python"
brew "rbenv"
# brew "redis"
brew "ruby-build"
brew "shellcheck"
# brew "sqlite"
brew "terraform"
brew "terragrunt"
# brew "vault"
brew "yarn"
#
#-----------------------------------------------------------------------
# APPLICATIONS (CASKS)
#-----------------------------------------------------------------------
#
cask "1password"
cask "a-better-finder-rename"
# cask "adobe-creative-cloud"
# cask "adobe-photoshop-lightroom"
# cask "adobe-reader"
cask "alfred"
# cask "atom"
# cask "audacity"
# cask "blue-jeans"
# cask "citrix-receiver"
# cask "cyberduck"
# cask "dash"
# cask "dash-beta"
cask "docker"
# cask "drobo-dashboard"
# cask "dropbox"
# cask "evernote"
# cask "filezilla"
# cask "firefox"
# cask "flash"
# cask "gimp"
# cask "github"
# cask "gitkraken"
# cask "gitx"
cask "google-chrome"
cask "handbrake"
cask "imagealpha"
cask "imageoptim"
# cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
# cask "jenkins"
# cask "jenkins-lts"
# cask "jenkins-menu"
# cask "kaleidoscope"
# cask "keka"
# cask "little-snitch"
cask "macpar-deluxe"
# cask "mamp"
# cask "microsoft-lync"
# cask "microsoft-office"
cask "mongodb-compass"
# cask "openoffice"
# cask "phpstorm"
cask "postman"
# cask "robo-3t"
# cask "screenflow"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "sourcetree"
# cask "spectacle"
# cask "stellarium"
# cask "sublime-text"
# cask "svnx"
# cask "textexpander"
cask "the-unarchiver"
# cask "tower"
# cask "transmission"
# cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
# cask "webstorm"
# cask "whatsapp"
cask "wineskin-winery"
cask "xld"
cask "xquartz"
# cask "xtrafinder"
cask "zoom"
#
#-----------------------------------------------------------------------
# FONTS (CASKS)
#-----------------------------------------------------------------------
#
cask "font-arimo"
cask "font-dejavu-sans"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-lora"
cask "font-open-iconic"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
